In [1]:
import pandas as pd
student=pd.read_csv("student1.csv")
student

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL
3         VARAM  S180319     87    CSE
4       NAVEENA  S180320     83    EEE
5         NAVYA  S180321     88   MECH
6        VANAJA  S180322     87  CIVIL
7      USHA SRI  S180323     84    ECE

In [2]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    8 non-null      object
 1   ID      8 non-null      object
 2   MARKS   8 non-null      int64
 3   GROUP   8 non-null      object
dtypes: int64(1), object(3)
memory usage: 384.0+ bytes

In [3]:
student.head(3)

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL

In [4]:
student.tail(3)

       NAME       ID  MARKS  GROUP
5     NAVYA  S180321     88   MECH
6    VANAJA  S180322     87  CIVIL
7  USHA SRI  S180323     84    ECE

In [5]:
student[["NAME","GROUP"]]

           NAME  GROUP
0       LAKSHMI    CSE
1          USHA    ECE
2  VENKATESWARI  CIVIL
3         VARAM    CSE
4       NAVEENA    EEE
5         NAVYA   MECH
6        VANAJA  CIVIL
7      USHA SRI    ECE

In [6]:
student.max()

NAME     VENKATESWARI
ID            S180323
MARKS              88
GROUP            MECH
dtype: object

In [7]:
student.min()

NAME     LAKSHMI
ID       S180316
MARKS         78
GROUP      CIVIL
dtype: object

In [8]:
type(student)

pandas.core.frame.DataFrame

In [9]:
student.MARKS.min()

78

In [10]:
student.MARKS.max()

88

In [11]:
student["NAME"]

0         LAKSHMI
1            USHA
2    VENKATESWARI
3           VARAM
4         NAVEENA
5           NAVYA
6          VANAJA
7        USHA SRI
Name: NAME, dtype: object

In [12]:
student["MARKS"].min()

78

In [13]:
student["MARKS"]>85

0    False
1    False
2    False
3     True
4    False
5     True
6     True
7    False
Name: MARKS, dtype: bool

In [14]:
student[student["MARKS"]>85]

     NAME       ID  MARKS  GROUP
3   VARAM  S180319     87    CSE
5   NAVYA  S180321     88   MECH
6  VANAJA  S180322     87  CIVIL

In [15]:
import pandas as pd
dict={"lakshmi":123,"sai":456,"maha":789,"raju":777}
print(dict)
pd.Series(dict)

{'lakshmi': 123, 'sai': 456, 'maha': 789, 'raju': 777}

lakshmi    123
sai        456
maha       789
raju       777
dtype: int64

In [16]:
import pandas as pd
student=pd.read_csv("student1.csv")
student

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL
3         VARAM  S180319     87    CSE
4       NAVEENA  S180320     83    EEE
5         NAVYA  S180321     88   MECH
6        VANAJA  S180322     87  CIVIL
7      USHA SRI  S180323     84    ECE

In [17]:
print(student.loc[0])

NAME     LAKSHMI
ID       S180316
MARKS         85
GROUP        CSE
Name: 0, dtype: object

In [18]:
print(student.loc[student["MARKS"]>85])

     NAME       ID  MARKS  GROUP
3   VARAM  S180319     87    CSE
5   NAVYA  S180321     88   MECH
6  VANAJA  S180322     87  CIVIL

In [19]:
student["ADDRESS"]=["a","b","c","d","e","f","g","h"]

In [20]:
student

           NAME       ID  MARKS  GROUP ADDRESS
0       LAKSHMI  S180316     85    CSE       a
1          USHA  S180317     78    ECE       b
2  VENKATESWARI  S180318     82  CIVIL       c
3         VARAM  S180319     87    CSE       d
4       NAVEENA  S180320     83    EEE       e
5         NAVYA  S180321     88   MECH       f
6        VANAJA  S180322     87  CIVIL       g
7      USHA SRI  S180323     84    ECE       h

In [21]:
student["AGE"]=0
student

           NAME       ID  MARKS  GROUP ADDRESS  AGE
0       LAKSHMI  S180316     85    CSE       a    0
1          USHA  S180317     78    ECE       b    0
2  VENKATESWARI  S180318     82  CIVIL       c    0
3         VARAM  S180319     87    CSE       d    0
4       NAVEENA  S180320     83    EEE       e    0
5         NAVYA  S180321     88   MECH       f    0
6        VANAJA  S180322     87  CIVIL       g    0
7      USHA SRI  S180323     84    ECE       h    0

In [22]:
student.loc[5,"NAME"]

'NAVYA'

In [23]:
newstudent=student[(student.MARKS>85)&(student.AGE>=0)]
newstudent

     NAME       ID  MARKS  GROUP ADDRESS  AGE
3   VARAM  S180319     87    CSE       d    0
5   NAVYA  S180321     88   MECH       f    0
6  VANAJA  S180322     87  CIVIL       g    0

In [24]:
newstudent["MARKS"]

3    87
5    88
6    87
Name: MARKS, dtype: int64

In [25]:
df.Coulmns()

NameError: name 'df' is not defined

In [26]:
import pandas as pd
student=pd.read_csv("student1.csv")
student

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL
3         VARAM  S180319     87    CSE
4       NAVEENA  S180320     83    EEE
5         NAVYA  S180321     88   MECH
6        VANAJA  S180322     87  CIVIL
7      USHA SRI  S180323     84    ECE

In [27]:
student["MARKS"].astype("float64")

0    85.0
1    78.0
2    82.0
3    87.0
4    83.0
5    88.0
6    87.0
7    84.0
Name: MARKS, dtype: float64

In [28]:
import pandas as pd
student=pd.read_csv("student1.csv")
student

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL
3         VARAM  S180319     87    CSE
4       NAVEENA  S180320     83    EEE
5         NAVYA  S180321     88   MECH
6        VANAJA  S180322     87  CIVIL
7      USHA SRI  S180323     84    ECE

In [29]:

student.rename(
    columns=({'NAME':'Name_of_student','ID':'ID_NO','MARKS':"Marks",'GROUP':'group'}),
)

  Name_of_student    ID_NO  Marks  group
0         LAKSHMI  S180316     85    CSE
1            USHA  S180317     78    ECE
2    VENKATESWARI  S180318     82  CIVIL
3           VARAM  S180319     87    CSE
4         NAVEENA  S180320     83    EEE
5           NAVYA  S180321     88   MECH
6          VANAJA  S180322     87  CIVIL
7        USHA SRI  S180323     84    ECE

In [30]:
student

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL
3         VARAM  S180319     87    CSE
4       NAVEENA  S180320     83    EEE
5         NAVYA  S180321     88   MECH
6        VANAJA  S180322     87  CIVIL
7      USHA SRI  S180323     84    ECE

In [31]:
student=pd.read_csv("student1.csv",header=None)

In [32]:
student

              0        1      2      3
0          NAME       ID  MARKS  GROUP
1       LAKSHMI  S180316     85    CSE
2          USHA  S180317     78    ECE
3  VENKATESWARI  S180318     82  CIVIL
4         VARAM  S180319     87    CSE
5       NAVEENA  S180320     83    EEE
6         NAVYA  S180321     88   MECH
7        VANAJA  S180322     87  CIVIL
8      USHA SRI  S180323     84    ECE

KeyError: '2'

In [35]:
import pandas as pd
student=pd.read_csv("student1.csv")
student

           NAME       ID  MARKS  GROUP
0       LAKSHMI  S180316     85    CSE
1          USHA  S180317     78    ECE
2  VENKATESWARI  S180318     82  CIVIL
3         VARAM  S180319     87    CSE
4       NAVEENA  S180320     83    EEE
5         NAVYA  S180321     88   MECH
6        VANAJA  S180322     87  CIVIL
7      USHA SRI  S180323     84    ECE

In [37]:
student["MARKS"].astype("float64")

0    85.0
1    78.0
2    82.0
3    87.0
4    83.0
5    88.0
6    87.0
7    84.0
Name: MARKS, dtype: float64

In [41]:
student["MARKS"]=student["MARKS"]/student["MARKS".max()]

AttributeError: 'str' object has no attribute 'max'

In [43]:
import numpy as np
np.linspace(10,20,30)

array([10.        , 10.34482759, 10.68965517, 11.03448276, 11.37931034,
       11.72413793, 12.06896552, 12.4137931 , 12.75862069, 13.10344828,
       13.44827586, 13.79310345, 14.13793103, 14.48275862, 14.82758621,
       15.17241379, 15.51724138, 15.86206897, 16.20689655, 16.55172414,
       16.89655172, 17.24137931, 17.5862069 , 17.93103448, 18.27586207,
       18.62068966, 18.96551724, 19.31034483, 19.65517241, 20.        ])